In [30]:
import pandas as pd

record1=pd.Series({"Name":"Trevin",
                "Year":'21',
                "School":"St.Josephs College",
                "University:"University of Colombo"})
record1

import pandas as pd

record1 = pd.Series({
    "Name": "Trevin",
    "Age": '21',
    "School": "St. Joseph's College",
    "University": "University of Colombo"
})
record1

SyntaxError: '{' was never closed (1650482254.py, line 3)

In [31]:


record2 = pd.Series({
    "Name": "Seniya",
    "Age": '23',
    "School": "St. Joseph's College",
    "University": "SLIIT"
})

record2

Name                        Seniya
Age                             23
School        St. Joseph's College
University                   SLIIT
dtype: object

In [32]:


record3 = pd.Series({
    "Name": "Kavishka",
    "Age": '26',
    "School": "St. Joseph's College",
    "University": "NSBM"
})
record3

Name                      Kavishka
Age                             26
School        St. Joseph's College
University                    NSBM
dtype: object

In [33]:
df=pd.DataFrame([record1,record2,record3],index=['Youngest','Middle','Eldest'])
df

              Name Age                School             University
Youngest    Trevin  21  St. Joseph's College  University of Colombo
Middle      Seniya  23  St. Joseph's College                  SLIIT
Eldest    Kavishka  26  St. Joseph's College                   NSBM

In [34]:
df.head(1)

            Name Age                School             University
Youngest  Trevin  21  St. Joseph's College  University of Colombo

In [36]:
df.head(2)

            Name Age                School             University
Youngest  Trevin  21  St. Joseph's College  University of Colombo
Middle    Seniya  23  St. Joseph's College                  SLIIT